// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   TouchStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell touch command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_TOUCH_CANNOT_TOUCH         #language eng  "%Htouch%N: Cannot touch %hs - %r\n"

#string STR_TOUCH_OK                   #language eng  "%Htouch%N: %s [ok]\n"

#string STR_TOUCH_OUT_OF_MEM           #language eng  "%Htouch%N: Out of memory\n"

#string STR_TOUCH_LINE_HELP            #language eng  "Updates time and date with current time"

#string STR_TOUCH_VERBOSE_HELP         #language eng  "Updates time and date with current time.\n"
                                                      "\n"
                                                      "TOUCH [-r] file [file ...]\n"
                                                      "\n"
                                                      "    -r    - Recursive to subdirectories\n"
                                                      "    file  - The name or pattern of the file or directory. There can be\n"
                                                      "            multiple files on the command line.\n"
                                                      "\n"
                                                      "    Notes:  1. If multiple files are specified on the command line,\n"
                                                      "               it will continue processing even fail to touch some of \n"
                                                      "               them.\n"
                                                      "            2. Touch cannot change the time and date of read-only\n"
                                                      "               files and directories.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To touch a file(the time and date of the file will be changed after TOUCH):\n"
                                                      "    fs0:\\> ls for.nsh\n"
                                                      "    Directory of: fs0:\\ \n"
                                                      "      06/18/01  09:32p                  153  for.nsh\n"
                                                      "              1 File(s)         153 bytes\n"
                                                      "              0 Dir(s)\n"
                                                      "\n"
                                                      "    fs0:\\> touch for.nsh\n"
                                                      "    touch: fs0:\\for.nsh [ok]\n"
                                                      "\n"
                                                      "    fs0:\\> ls for.nsh\n"
                                                      "    Directory of: fs0:\\ \n"
                                                      "      06/19/01  09:54a                  153  for.nsh\n"
                                                      "              1 File(s)         153 bytes\n"
                                                      "              0 Dir(s)\n"
                                                      "\n"
                                                      "  * To touch a directory recursively:\n"
                                                      "    fs0:\\> touch -r efi1.1\n"
                                                      "    touch: fs0:\\efi1.1 [ok]\n"
                                                      "    touch: fs0:\\efi1.1\\boot [ok]\n"
                                                      "    touch: fs0:\\efi1.1\\boot\\nshell.efi [ok]\n"
                                                      "\n"
                                                      "Shell>\n"
